DataProcessors/ПечатьМНО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ПечатьМНО</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогСохранения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Каталог530Формы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/НомераОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>НомераОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНумерации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНумерацииОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВыводЦенныхБумаг</v8:Type>
						<v8:Type>cfg:DocumentRef.Распоряжение</v8:Type>
						<v8:Type>cfg:DocumentRef.АнкетаФизическогоЛица</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыводДенежныхСредств</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КлиентыДоверительногоУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КлиентыДоверительногоУправления</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КлиентыДоверительногоУправления</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОперацийБэкОфиса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыОперацийБэкОфиса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АктПриемаПередачиОбъектовНедвижимости</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводКредитногоИнструмента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводОстатковАктивовСтраховыхКомпаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводПрочихАктивов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВключениеПрочегоИмуществаВСоставПИФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыводДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыводКредитногоИнструмента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыводЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеКредитногоИнструмента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗачислениеПаев</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеУсловийСделки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнениеОбязательствПоСделке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнениеОбязательствПоСделкеСПФИ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнениеРешенияОбИзмененииУставногоКапиталаООО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонвертацияЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаРегистров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Маржа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеДивидендов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеРезервовПИФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеСписаниеРезервов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаСделки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводПаев</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеКупона</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеПаев</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеЦеннойБумаги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеНаДвижениеДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеНаДвижениеЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоставкаЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходПроцентовМНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходПроцентовПоКредитномуИнструменту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазмещениеКредитногоИнструмента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспределениеДоходаПайщикам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОбИзмененииУставногоКапиталаООО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СведенияОРегистрацииПраваСобственности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СводнаяБиржеваяСделка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СводноеИсполнениеОбязательствПоБиржевымСделкам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сделка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаРЕПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаСВалютой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаСМО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаСНедвижимостью</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаСПФИ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятиеЦеннойБумагиСУчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеЗадолженностейПоПоручению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеЦеннойБумаги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СторнированиеМНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетФактура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Распоряжение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПоручениеНаПереводДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПоручениеНаПереводДенежныхСредств</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчетПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БрокерПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХраненияПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрочныйПереводБЭСП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХраненияСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХраненияПолучательСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ПечатьМНО/Ext/ManagerModule.bsl
Функция СформироватьМенеджерВременныхТаблицСДанными(МассивДокументов) Экспорт
	
	МВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
#Область ТЕКСТ_ЗАПРОСА
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПоручениеНаПереводДенежныхСредств.Ссылка КАК Ссылка,
		|	ПоручениеНаПереводДенежныхСредств.Дата КАК Дата,
		|	ПоручениеНаПереводДенежныхСредств.Организация КАК Организация,
		|	ПоручениеНаПереводДенежныхСредств.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ПоручениеНаПереводДенежныхСредств.РасчетныйСчетПолучатель КАК РасчетныйСчетПолучатель,
		|	ПоручениеНаПереводДенежныхСредств.Валюта КАК Валюта,
		|	ПоручениеНаПереводДенежныхСредств.Сумма КАК Сумма,
		|	ПоручениеНаПереводДенежныхСредств.Брокер КАК Брокер
		|ПОМЕСТИТЬ _ПорученияНаПеревод
		|ИЗ
		|	Документ.ПоручениеНаПереводДенежныхСредств КАК ПоручениеНаПереводДенежныхСредств
		|ГДЕ
		|	ПоручениеНаПереводДенежныхСредств.Ссылка В(&МассивДокументов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Распоряжение.Дата КАК Дата,
		|	Распоряжение.Организация КАК Организация,
		|	Распоряжение.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	Распоряжение.РасчетныйСчет КАК РасчетныйСчет,
		|	Распоряжение.Валюта КАК Валюта,
		|	Распоряжение.Сумма КАК Сумма,
		|	Распоряжение.Процент КАК Процент,
		|	Распоряжение.ДатаВозврата КАК ДатаВозврата,
		|	ВЫБОР
		|		КОГДА НомераОбъектов.Номер МЕЖДУ ""000001"" И ""000009""
		|			ТОГДА ПОДСТРОКА(НомераОбъектов.Номер, 6, 1)
		|		КОГДА НомераОбъектов.Номер МЕЖДУ ""000010"" И ""000099""
		|			ТОГДА ПОДСТРОКА(НомераОбъектов.Номер, 5, 2)
		|		КОГДА НомераОбъектов.Номер МЕЖДУ ""000100"" И ""000999""
		|			ТОГДА ПОДСТРОКА(НомераОбъектов.Номер, 4, 3)
		|		КОГДА НомераОбъектов.Номер МЕЖДУ ""001000"" И ""009999""
		|			ТОГДА ПОДСТРОКА(НомераОбъектов.Номер, 3, 4)
		|		КОГДА НомераОбъектов.Номер МЕЖДУ ""010000"" И ""099999""
		|			ТОГДА ПОДСТРОКА(НомераОбъектов.Номер, 2, 5)
		|		ИНАЧЕ НомераОбъектов.Номер
		|	КОНЕЦ КАК НомерПодтверждения,
		|	NULL КАК Брокер
		|ПОМЕСТИТЬ _ДанныеДокументов
		|ИЗ
		|	Документ.Распоряжение КАК Распоряжение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НомераОбъектов КАК НомераОбъектов
		|		ПО Распоряжение.Ссылка = НомераОбъектов.Объект
		|			И Распоряжение.Организация = НомераОбъектов.Организация
		|			И (НомераОбъектов.ВидНумерации = ЗНАЧЕНИЕ(Справочник.ВидыНумерацииОбъектов.РаспоряженияНаМНО))
		|ГДЕ
		|	Распоряжение.Ссылка В(&МассивДокументов)
		|	И Распоряжение.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.МНО)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ПорученияНаПеревод.Дата,
		|	_ПорученияНаПеревод.Организация,
		|	_ПорученияНаПеревод.СчетДоверительногоУправления,
		|	_ПорученияНаПеревод.РасчетныйСчетПолучатель,
		|	_ПорученияНаПеревод.Валюта,
		|	_ПорученияНаПеревод.Сумма,
		|	0,
		|	NULL,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПредыдущиеПоручения.Ссылка) + 1,
		|	_ПорученияНаПеревод.Брокер
		|ИЗ
		|	_ПорученияНаПеревод КАК _ПорученияНаПеревод
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПорученияНаПеревод КАК ПредыдущиеПоручения
		|		ПО _ПорученияНаПеревод.Организация = ПредыдущиеПоручения.Организация
		|			И _ПорученияНаПеревод.СчетДоверительногоУправления = ПредыдущиеПоручения.СчетДоверительногоУправления
		|			И _ПорученияНаПеревод.Ссылка <> ПредыдущиеПоручения.Ссылка
		|			И _ПорученияНаПеревод.Дата > ПредыдущиеПоручения.Дата
		|
		|СГРУППИРОВАТЬ ПО
		|	_ПорученияНаПеревод.Дата,
		|	_ПорученияНаПеревод.Организация,
		|	_ПорученияНаПеревод.СчетДоверительногоУправления,
		|	_ПорученияНаПеревод.РасчетныйСчетПолучатель,
		|	_ПорученияНаПеревод.Валюта,
		|	_ПорученияНаПеревод.Сумма,
		|	_ПорученияНаПеревод.Брокер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Объект КАК Объект,
		|	РеквизитыЮридическихЛиц.Период КАК Период,
		|	РеквизитыЮридическихЛиц.ИНН КАК ИНН,
		|	РеквизитыЮридическихЛиц.ОГРН КАК ОГРН,
		|	РеквизитыЮридическихЛиц.КраткоеНаименованиеПоУставу КАК КраткоеНаименованиеПоУставу,
		|	РеквизитыЮридическихЛиц.ПолноеНаименованиеПоУставу КАК ПолноеНаименованиеПоУставу
		|ПОМЕСТИТЬ _ПолнаяТаблицаРеквизитов
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		_ДанныеДокументов.Дата КАК Дата,
		|		_ДанныеДокументов.РасчетныйСчет КАК Объект,
		|		_ДанныеДокументов.РасчетныйСчет.Банк.ЮрФизЛицо КАК ЮрЛицо
		|	ИЗ
		|		_ДанныеДокументов КАК _ДанныеДокументов
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		_ДанныеДокументов.Дата,
		|		_ДанныеДокументов.СчетДоверительногоУправления.СпециализированныйДепозитарий,
		|		_ДанныеДокументов.СчетДоверительногоУправления.СпециализированныйДепозитарий.ЮрФизЛицо
		|	ИЗ
		|		_ДанныеДокументов КАК _ДанныеДокументов
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		_ДанныеДокументов.Дата,
		|		_ДанныеДокументов.Брокер,
		|		_ДанныеДокументов.Брокер.ЮрФизЛицо
		|	ИЗ
		|		_ДанныеДокументов КАК _ДанныеДокументов) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц КАК РеквизитыЮридическихЛиц
		|		ПО ВложенныйЗапрос.ЮрЛицо = РеквизитыЮридическихЛиц.ЮрФизЛицо
		|			И (РеквизитыЮридическихЛиц.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний))
		|			И (РеквизитыЮридическихЛиц.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
		|			И ВложенныйЗапрос.Дата >= РеквизитыЮридическихЛиц.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Объект КАК Объект,
		|	_ПолнаяТаблицаРеквизитов.ИНН КАК ИНН,
		|	_ПолнаяТаблицаРеквизитов.ОГРН КАК ОГРН,
		|	_ПолнаяТаблицаРеквизитов.КраткоеНаименованиеПоУставу КАК КраткоеНаименованиеПоУставу,
		|	_ПолнаяТаблицаРеквизитов.ПолноеНаименованиеПоУставу КАК ПолноеНаименованиеПоУставу
		|ПОМЕСТИТЬ РеквизитыЮрЛиц
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ПолнаяТаблицаРеквизитов.Объект КАК Объект,
		|		МАКСИМУМ(_ПолнаяТаблицаРеквизитов.Период) КАК Период
		|	ИЗ
		|		_ПолнаяТаблицаРеквизитов КАК _ПолнаяТаблицаРеквизитов
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_ПолнаяТаблицаРеквизитов.Объект) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПолнаяТаблицаРеквизитов КАК _ПолнаяТаблицаРеквизитов
		|		ПО ВложенныйЗапрос.Объект = _ПолнаяТаблицаРеквизитов.Объект
		|			И ВложенныйЗапрос.Период = _ПолнаяТаблицаРеквизитов.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ДанныеДокументов.Дата КАК ДатаДок,
		|	_ДанныеДокументов.Организация КАК Организация,
		|	_ДанныеДокументов.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	КлиентыДоверительногоУправления.Период КАК Период,
		|	КлиентыДоверительногоУправления.Клиент КАК Клиент
		|ПОМЕСТИТЬ _ПолнаяТаблицаКлиентов
		|ИЗ
		|	_ДанныеДокументов КАК _ДанныеДокументов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления КАК КлиентыДоверительногоУправления
		|		ПО _ДанныеДокументов.СчетДоверительногоУправления = КлиентыДоверительногоУправления.СчетДоверительногоУправления
		|			И _ДанныеДокументов.Дата >= КлиентыДоверительногоУправления.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.ДокДата КАК ДокДата,
		|	ВложенныйЗапрос.Организация КАК Организация,
		|	ВложенныйЗапрос.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ПолнаяТаблицаКлиентов.Клиент КАК Клиент
		|ПОМЕСТИТЬ _Клиенты
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ПолнаяТаблицаКлиентов.ДатаДок КАК ДокДата,
		|		_ПолнаяТаблицаКлиентов.Организация КАК Организация,
		|		_ПолнаяТаблицаКлиентов.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		МАКСИМУМ(_ПолнаяТаблицаКлиентов.Период) КАК Период
		|	ИЗ
		|		_ПолнаяТаблицаКлиентов КАК _ПолнаяТаблицаКлиентов
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_ПолнаяТаблицаКлиентов.ДатаДок,
		|		_ПолнаяТаблицаКлиентов.Организация,
		|		_ПолнаяТаблицаКлиентов.СчетДоверительногоУправления) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПолнаяТаблицаКлиентов КАК _ПолнаяТаблицаКлиентов
		|		ПО ВложенныйЗапрос.СчетДоверительногоУправления = _ПолнаяТаблицаКлиентов.СчетДоверительногоУправления
		|			И ВложенныйЗапрос.Период = _ПолнаяТаблицаКлиентов.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВложенныйЗапрос.Объект КАК Объект,
		|	ВложенныйЗапрос.ЮрФизЛицо КАК ЮрФизЛицо,
		|	ВложенныйЗапрос.ЭтоОрганизация КАК ЭтоОрганизация,
		|	ЕСТЬNULL(РеквизитыЮридическихЛицАнкетные.Период, РеквизитыФизическихЛицАнкетные.Период) КАК Период,
		|	ЕСТЬNULL(РеквизитыЮридическихЛицАнкетные.КраткоеНаименованиеПоУставу, РеквизитыФизическихЛицАнкетные.Фамилия + РеквизитыФизическихЛицАнкетные.Имя + РеквизитыФизическихЛицАнкетные.Отчество) КАК Наименование,
		|	ЕСТЬNULL(РеквизитыЮридическихЛицАнкетные.ПолноеНаименованиеПоУставу, """") КАК ПолноеНаименованиеПоУставу
		|ПОМЕСТИТЬ _ПолнаяТаблицаРеквизитовИзАнкет
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		_Клиенты.ДокДата КАК ДокДата,
		|		_Клиенты.Организация КАК Организация,
		|		_Клиенты.СчетДоверительногоУправления КАК Объект,
		|		_Клиенты.Клиент КАК ЮрФизЛицо,
		|		ЛОЖЬ КАК ЭтоОрганизация
		|	ИЗ
		|		_Клиенты КАК _Клиенты
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		_ДанныеДокументов.Дата,
		|		_ДанныеДокументов.Организация,
		|		_ДанныеДокументов.Организация,
		|		_ДанныеДокументов.Организация.ЮрФизЛицо,
		|		ИСТИНА
		|	ИЗ
		|		_ДанныеДокументов КАК _ДанныеДокументов) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные КАК РеквизитыЮридическихЛицАнкетные
		|		ПО ВложенныйЗапрос.ЮрФизЛицо = РеквизитыЮридическихЛицАнкетные.ЮрФизЛицо
		|			И ВложенныйЗапрос.Организация = РеквизитыЮридическихЛицАнкетные.Организация
		|			И (РеквизитыЮридическихЛицАнкетные.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
		|			И ВложенныйЗапрос.ДокДата >= РеквизитыЮридическихЛицАнкетные.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные КАК РеквизитыФизическихЛицАнкетные
		|		ПО ВложенныйЗапрос.ЮрФизЛицо = РеквизитыФизическихЛицАнкетные.ЮрФизЛицо
		|			И ВложенныйЗапрос.Организация = РеквизитыФизическихЛицАнкетные.Организация
		|			И (РеквизитыФизическихЛицАнкетные.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
		|			И ВложенныйЗапрос.ДокДата >= РеквизитыФизическихЛицАнкетные.Период
		|			И (НЕ ВложенныйЗапрос.ЭтоОрганизация)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Объект КАК Объект,
		|	ВложенныйЗапрос.ЮрФизЛицо ССЫЛКА Справочник.ПаевыеИнвестиционныеФонды КАК ЭтоПиф,
		|	ВложенныйЗапрос.ЮрФизЛицо КАК ЮрФизЛицо,
		|	ВложенныйЗапрос.ЭтоОрганизация КАК ЭтоОрганизация,
		|	_ПолнаяТаблицаРеквизитовИзАнкет.Наименование КАК Наименование,
		|	_ПолнаяТаблицаРеквизитовИзАнкет.ПолноеНаименованиеПоУставу КАК ПолноеНаименованиеПоУставу
		|ПОМЕСТИТЬ _РеквизитыЮрФизЛицАнкетные
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ПолнаяТаблицаРеквизитовИзАнкет.Объект КАК Объект,
		|		_ПолнаяТаблицаРеквизитовИзАнкет.ЮрФизЛицо КАК ЮрФизЛицо,
		|		_ПолнаяТаблицаРеквизитовИзАнкет.ЭтоОрганизация КАК ЭтоОрганизация,
		|		МАКСИМУМ(_ПолнаяТаблицаРеквизитовИзАнкет.Период) КАК Период
		|	ИЗ
		|		_ПолнаяТаблицаРеквизитовИзАнкет КАК _ПолнаяТаблицаРеквизитовИзАнкет
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_ПолнаяТаблицаРеквизитовИзАнкет.Объект,
		|		_ПолнаяТаблицаРеквизитовИзАнкет.ЮрФизЛицо,
		|		_ПолнаяТаблицаРеквизитовИзАнкет.ЭтоОрганизация) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПолнаяТаблицаРеквизитовИзАнкет КАК _ПолнаяТаблицаРеквизитовИзАнкет
		|		ПО ВложенныйЗапрос.Объект = _ПолнаяТаблицаРеквизитовИзАнкет.Объект
		|			И ВложенныйЗапрос.ЭтоОрганизация = _ПолнаяТаблицаРеквизитовИзАнкет.ЭтоОрганизация
		|			И ВложенныйЗапрос.Период = _ПолнаяТаблицаРеквизитовИзАнкет.Период";
#КонецОбласти

	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	Запрос.Выполнить();	
		
	Возврат МВТ;	
			
КонецФункции
